In [71]:
# bu benim ilk comment im
# degisken - variable
# integer(tamsayi) degisken- variable
tamsayi_degiskeni = 10 # 10 tamsayisi icin bir degisken tanimladim, bu degiskenin ismi tamsayi_degiskeni
tamsayi_degiskeni2 = 15
print(tamsayi_degiskeni)
print(tamsayi_degiskeni2)

10
15

**Kesirli Sayi**

In [72]:
# kesirli sayi - float
kesirlisayi_degisken = 10.5
print(kesirlisayi_degisken)

10.5

4 işlem özelliği

In [73]:
toplam = tamsayi_degiskeni + tamsayi_degiskeni2
carpma = tamsayi_degiskeni * tamsayi_degiskeni2
cikarma = tamsayi_degiskeni - tamsayi_degiskeni2
bolme = tamsayi_degiskeni / tamsayi_degiskeni2
print(toplam)
print(carpma)
print(cikarma)
print(bolme)

25
150
-5
0.6666666666666666

In [74]:
metin = "hello world" # string - metin
print(metin)

hello world

In [75]:
type(metin)

str

In [76]:
metin1 = "merhaba"
bosluk = " "
metin2 = "dunya"
metin1 + bosluk + metin2

'merhaba dunya'

In [77]:
# f string
# elma: 10 tl
# armut: 20 tl
elma_degisken = 10
armut_degisken = 20
print(f"elma: {elma_degisken} tl, armut: {armut_degisken} tl")
print("elma: {} tl, armut: {} tl".format(elma_degisken, armut_degisken))
# elma: {elma_degisken} tl, armut: {armut_degisken} tl
# elma: 10 tl, armut: 20 tl

elma: 10 tl, armut: 20 tl
elma: 10 tl, armut: 20 tl

Python Syntax

In [78]:
temel = 6
TEMEL = 7
print(temel)
print(TEMEL)

6
7

In [79]:
# COMMENT
"""
 istedigimiz her seyi yazariz kimsade bize karisamaz
"""

'\n istedigimiz her seyi yazariz kimsade bize karisamaz\n'

In [80]:
print(5) # print = build-in function

5

In [81]:
# print = 10

In [82]:
print(5)

5

**Fonksiyonlar**


*   Kullanıcı Tanımlı Fonksiyonlar (User Defined Function)

In [83]:
# dairenin alanını hesaplamak pi*r^2
pi = 3.14
daire_yaricapi = 3
daire_alani = pi*(daire_yaricapi**2)
print(daire_alani)

28.26

In [84]:
def daireAlaniHesapla(daire_yaricapi = 5): # func ismi yazarken islevi belirtmek lazim
  """
    Description: Bu fonksiyon daire alanini hesaplar.
    input parameters: dairenin yaricapi (daire_yaricapi)
    output: dairenin alani (daire_alani)
  """
  PI = 3.14
  daire_alani = PI*(daire_yaricapi**2)
  print(f"Daire Alani: {daire_alani}")
  return daire_alani

In [85]:
daireAlaniHesapla()

Daire Alani: 78.5

78.5

In [86]:
user_input  = input("Bir daire yari capi girin: ")
print(f"girilen deger: {user_input} ve bu degerin type: {type(user_input)}")
user_input_int = int(user_input)
print(f"{type(user_input_int)}")
daireAlaniHesapla(user_input_int)

Bir daire yari capi girin:  8

girilen deger: 8 ve bu degerin type: <class 'str'>
<class 'int'>
Daire Alani: 200.96

200.96

In [87]:
daire_alani_hesaplanan1 = daireAlaniHesapla(5)
daire_alani_hesaplanan2 = daireAlaniHesapla(3)
print(daire_alani_hesaplanan1 + daire_alani_hesaplanan2)

Daire Alani: 78.5
Daire Alani: 28.26
106.76

In [88]:
# daire cevresi hesaplama: 2*pi*r
def daireCevresiHesapla(r):
  PI = 3.14
  daire_cevresi = 2*PI*r
  return daire_cevresi

In [89]:
daire_cevresi_hesaplanan = daireCevresiHesapla(5)
print(f"hesapladigimiz daire ccevresi: {daire_cevresi_hesaplanan}")

hesapladigimiz daire ccevresi: 31.400000000000002

#### Veri Tipi: LISTE

In [90]:
liste = ["sut", "yumurta", "ekmek"]
liste

['sut', 'yumurta', 'ekmek']

In [91]:
liste_fiyat = [10,20,30] 
liste_fiyat

[10, 20, 30]

In [92]:
type(liste_fiyat)

list

In [93]:
hafta_liste = ["pazartesi", "sali", "cars", "persembe", "cuma","cumertesi", "pazar"]

In [94]:
print(hafta_liste[:3])
print(hafta_liste[3:])
print(hafta_liste[3:7])
print(hafta_liste[-4:])

['pazartesi', 'sali', 'cars']
['persembe', 'cuma', 'cumertesi', 'pazar']
['persembe', 'cuma', 'cumertesi', 'pazar']
['persembe', 'cuma', 'cumertesi', 'pazar']

In [95]:
###
sayi_listesi = [1,3,2,4,6,5]
sayi_listesi

[1, 3, 2, 4, 6, 5]

In [96]:
sayi_listesi.append(6)

In [97]:
sayi_listesi

[1, 3, 2, 4, 6, 5, 6]

In [98]:
sayi_listesi.remove(6)

In [99]:
sayi_listesi

[1, 3, 2, 4, 5, 6]

In [100]:
sorted(sayi_listesi)

[1, 2, 3, 4, 5, 6]

#### Veri Tipi: Tuple

In [101]:
tuple_sayi = (1,2,3,3,3,4,5,6)
print(tuple_sayi[-2])
print(tuple_sayi[1])
print(tuple_sayi[1:])
print(tuple_sayi.count(3))  # tuple icerisinde bulunan istedigimiz elemani sayma

5
2
(2, 3, 3, 3, 4, 5, 6)
3

#### Veri Tipi: Dictionary
        anahtar-deger : key-value pair

In [102]:
dictionary = {"anahtar" : 10,
              "key": "ankara"}
dictionary

{'anahtar': 10, 'key': 'ankara'}

In [103]:
sehirler_plakalar ={
                        "ankara": 6,
                        "izmir" : 35,
                        "istanul": 34,
                        "kayseri": 38
}

In [104]:
sehirler_plakalar.keys()

dict_keys(['ankara', 'izmir', 'istanul', 'kayseri'])

In [105]:
sehirler_plakalar.values()

dict_values([6, 35, 34, 38])

In [106]:
sehirler_plakalar["izmir"]

35

In [107]:
"""
parameters = {"weights": [],
              "bias": [],
              "learning_rate": 0,
              "model_name": "model1"
             }
list_parameters = []
list_parameters.append(parameters)

"""

'\nparameters = {"weights": [],\n              "bias": [],\n              "learning_rate": 0,\n              "model_name": "model1"\n             }\nlist_parameters = []\nlist_parameters.append(parameters)\n\n'

#### Veri Tipleri Donusumleri

In [108]:
metin = "16"
kesirlisayi = 10.5
tamsayi = 10

In [109]:
# str -> int
metin_int = int(metin)
print(metin_int)
print(type(metin_int))

16
<class 'int'>

In [110]:
# float -> int
kesirlisayi_int = int(kesirlisayi)
print(kesirlisayi_int)
print(type(kesirlisayi_int))

10
<class 'int'>

In [111]:
# float -> str
kesirlisayi_str = str(kesirlisayi)
kesirlisayi_str

'10.5'

In [112]:
# int -> float
tamsayi_float = float(tamsayi)
tamsayi_float

10.0

In [113]:
# int -> str
tamsayi_str = str(tamsayi)
tamsayi_str

'10'

#### IF - ELSE

In [114]:
haftanin_gunleri = ["pazartesi", "sali", "cars", "persembe", "cuma","cumertesi", "pazar"]
if haftanin_gunleri[2] == "pazartesi":
        print("Pazartesi gunu listenin ikinci indeksinde")
else:
        print("Pazartesi gunu listenin ikinci indeksinde degil")

Pazartesi gunu listenin ikinci indeksinde degil

#### FOR LOOP

In [115]:
for i in range(1,11):
    print(i)

1
2
3
4
5
6
7
8
9
10

In [116]:
for i in "pazartesi sali":
    print(i)

p
a
z
a
r
t
e
s
i

s
a
l
i

In [117]:
"""
problem : NLP, elimizde str olarak cumle var. Mesela: "Bugun Python Dersimiz Var."
["bugun","python","dersimiz","var."]

"""

cumle = "Bugun Python Dersimiz Var."
liste_cumle = cumle.split()
liste_cumle

liste = []
for i in liste_cumle:
    kelime_kucuk_harf = i.lower()
    liste.append(kelime_kucuk_harf)
    ## print(kelime_kucuk_harf)
print(liste)

['bugun', 'python', 'dersimiz', 'var.']

In [118]:
"""
problem: liste = [1,2,3,4,5,6]
fonksiyon
    girdi: liste
    cikti: listenin  icinde bulunan cift sayilarun toplami

"""
liste = [1, 2, 3, 4, 5, 6]
def cift_sayilarin_toplami(liste):
    toplam = 0
    for i in liste:
        if i % 2 == 0:
            toplam += i
    return toplam

sonuc = cift_sayilarin_toplami(liste)
print("Çift sayıların toplamı:", sonuc)

Çift sayıların toplamı: 12

# Numpy

In [119]:
import numpy as np

In [120]:
# numpy array olusturma
liste = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15]
dizi = np.array(liste)
dizi

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15])

In [121]:
# arrau boyutu
dizi.shape     # (15,0) -> 15x1 lik bir vektor

(15,)

In [122]:
# 15x1 lik bir arrayi 3x5 lik bir matrise cevirme
dizi2 = dizi.reshape(3,5)
dizi2

array([[ 1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10],
       [11, 12, 13, 14, 15]])

In [123]:
print("shape:", dizi2.shape)
print("dimension(boyut):", dizi2.ndim)
print("size:", dizi2.size)
print("type:", type(dizi2))

shape: (3, 5)
dimension(boyut): 2
size: 15
type: <class 'numpy.ndarray'>

In [124]:
dizi2D = np.array([[1,2,3,4],[5,6,7,8],[9,8,7,5]])
dizi2D

array([[1, 2, 3, 4],
       [5, 6, 7, 8],
       [9, 8, 7, 5]])

In [125]:
# sifirlardan olusan bir array olusturma

sifirdizisi = np.zeros((3,4))
sifirdizisi

array([[0., 0., 0., 0.],
       [0., 0., 0., 0.],
       [0., 0., 0., 0.]])

In [126]:
# birlerden olusan bir array olusturma

birdizisi = np.ones((3,4,5))
birdizisi

array([[[1., 1., 1., 1., 1.],
        [1., 1., 1., 1., 1.],
        [1., 1., 1., 1., 1.],
        [1., 1., 1., 1., 1.]],

       [[1., 1., 1., 1., 1.],
        [1., 1., 1., 1., 1.],
        [1., 1., 1., 1., 1.],
        [1., 1., 1., 1., 1.]],

       [[1., 1., 1., 1., 1.],
        [1., 1., 1., 1., 1.],
        [1., 1., 1., 1., 1.],
        [1., 1., 1., 1., 1.]]])

In [127]:
# bos bir array olusturma
bosdizi = np.empty((2,4))
bosdizi

array([[0., 0., 0., 0.],
       [0., 0., 0., 0.]])

In [128]:
# arange (x,y,basamak) x den baslar y ye (y dahil degil) kadar gider basamak buyuklugunde artarak ilerler
# 10, 50, basamak =5
dizi_aralik = np.arange(10,50,5)
dizi_aralik

array([10, 15, 20, 25, 30, 35, 40, 45])

In [129]:
# linspace (x,y,basamak) x ve y(dahil) araliginda basamak kadar sayiya boler
dizi_bosluk = np.linspace(10,50,9)
dizi_bosluk

array([10., 15., 20., 25., 30., 35., 40., 45., 50.])

##  Numpy Temel Operasyonlari

In [130]:
import numpy as np

In [131]:
a = np.array([1,2,3])
b = np.array([4,5,6])

In [132]:
print("Toplama: ", a+b)
print("Cikartma: ", a-b)
print("Carpma: ", a*b)
print("Bolme: ", a/b)
print("Karesi: ", a**2)
print("Kupu: ", a**3)

Toplama:  [5 7 9]
Cikartma:  [-3 -3 -3]
Carpma:  [ 4 10 18]
Bolme:  [0.25 0.4  0.5 ]
Karesi:  [1 4 9]
Kupu:  [ 1  8 27]

In [133]:
# Filtreleme
a = np.array([1,2,3])
a < 2                  # a arrayinin icinde bulunan 2 den kucuk degerleri goster

array([ True, False, False])

In [134]:
# matris carpimi
a = np.array([[1,2,3],
              [4,5,6]])  # 2x3

b = np.array([[4,5,6],
              [1,2,3]])  # 2x3  -> Transpose aliniyor 3x2
a.dot(b.T)

array([[32, 14],
       [77, 32]])

In [135]:
a = np.array([[1,2,3],
              [4,5,6]])  # 2x3
print(sum(a))
print(np.sum(a))
print(a.sum())

[5 7 9]
21
21

In [136]:
print(a.max())
print(a.min())
print(np.max(a))
print(np.min(a))

6
1
6
1

In [137]:
# satir satir toplama
print(a.sum(axis = 1))
# sutun sutun toplama
print(a.sum(axis = 0))

[ 6 15]
[5 7 9]

In [138]:
# sqrt (karekok alma)
np.sqrt(a)

array([[1.        , 1.41421356, 1.73205081],
       [2.        , 2.23606798, 2.44948974]])

In [139]:
# kare alma
print(np.square(a))
print(a**2)

[[ 1  4  9]
 [16 25 36]]
[[ 1  4  9]
 [16 25 36]]

In [140]:
# Rastgele sayi uretme
rastgele_dizi = np.random.random((3,3))  # Normal dagilima gore 0-1
rastgele_dizi

array([[0.55814017, 0.45782345, 0.85212685],
       [0.77193416, 0.1753977 , 0.38702123],
       [0.93080276, 0.8895059 , 0.66152083]])

In [141]:
# Rastgele sayi uretme
rastgele_dizi = np.random.normal(0,1,10)  # Normal dagilima gore 0 ortalamali 1 std sapmali, 5 deger uret
rastgele_dizi

array([ 0.79449249, -0.37235694, -0.6925551 ,  1.51736448,  1.100819  ,
       -0.67613743,  0.51140541, -0.70061236,  0.93538422,  0.76659015])

In [142]:
np.random.rand(3,3)

array([[0.78503037, 0.08444145, 0.51589984],
       [0.30860038, 0.69113513, 0.40584292],
       [0.85075932, 0.23936075, 0.02502929]])

In [143]:
np.random.normal(0,1,(5,3))

array([[ 0.41723832,  1.25874267, -0.03301079],
       [-1.21666733,  0.85617125,  0.31188268],
       [ 0.8428831 ,  1.34747815, -1.70098731],
       [-2.14054004, -1.56827045,  2.26128371],
       [ 1.66686956,  1.54941125,  0.660476  ]])

## Shape Manipulation

In [144]:
"""
1) A array = 2 boyutlu bir tane array -> (3,5)
2) B array = 1 boyutlu bir tane array -> (15,)
3) B array'ini (3,5) olacak sekilde reshape yapalim
4) C = A + B
5) D=linspace ve E=arange ile (3,5) lik matrisler olusturalim.
6) F = D + E
7) C'nin ve F'nin her bir elemanini for dongusu ile eleman eleman carpip G = (15,1) boyutunda elde edelim.
"""
import numpy as np
# 2 boyutlu bir dizi oluşturma (3x5)
A = np.random.rand(3, 5)  # 0 ile 1 arasında rastgele sayılarla dolu 3x5'lik bir dizi
# 1 boyutlu bir dizi oluşturma (15 elemanlı)
B = np.arange(15)  # 0'dan 14'e kadar sayıları içeren bir dizi
# B dizisini 3x5 boyutunda yeniden şekillendirme
B = B.reshape(3, 5)
# A ve B dizilerini toplama
C = A + B
D=np.linspace(10,50,15).reshape(3,5)
E=np.arange(10,160,10).reshape(3,5)
F=D+E
G = []
for i in range(C.shape[0]):  # 3
    for j in range(C.shape[1]):  # 5
        G.append(C[i, j] * F[i, j])

# Sonuçları ekrana yazdıralım
print("A array:")
print(A)

print("\nB array (reshape edilmiş):")
print(B)

print("\nC array (A + B):")
print(C)

print("\nD array (linspace ile oluşturulan):")
print(D)

print("\nE array (arange ile oluşturulan):")
print(E)

print("\nF array (D + E):")
print(F)

print("\nG array (C ve F'nin elemanlarının çarpımı, 15x1):")
print(G)
# print("G shape: ",np.array(G).shape)

# 8) C ve F'yi (15, 1) şekline getirip koşulu kontrol etme
C_flat = C.reshape(-1, 1)  # -1 otomatik olarak 15 elemanı kullanır
F_flat = F.reshape(-1, 1)

# G1 ve G2 listelerini tanımlama
G1 = []
G2 = []

# C'nin ilk elemanı ve F'nin son elemanı toplama işlemi ile ilerleme
for i in range(len(C_flat)):  # C_flat'in uzunluğunu kullanarak döngüyü oluştur
    toplam = C_flat[i, 0] + F_flat[len(F_flat) - 1 - i, 0]  # len kullanarak sondan eleman al
    if toplam > 1:
        G1.append(toplam)
    else:
        G2.append(toplam)

# Sonuçları yazdırma
print("G1 (Toplam > 1 olanlar):", G1)
print("G2 (Toplam <= 1 olanlar):", G2)
"""
###  EN BASINDA TERS CEVIRIP NORMAL TOPLAMA YAPILDI.
C = C.reshape(15,1)
F = F.reshape(15,1)
F =F[::-1]
G1 = []
G2 = []
for i in range(len(C)):
    toplam = C[i] + F[i]
    if toplam > 1:
        G1.append(toplam)
    else:
        G2.append(toplam)
print(G1,G2)
"""

A array:
[[0.35305445 0.65273507 0.92257913 0.14804026 0.97935445]
 [0.0527562  0.78566336 0.77828242 0.10579735 0.04323689]
 [0.89933825 0.83230937 0.19057566 0.1447855  0.41127203]]

B array (reshape edilmiş):
[[ 0  1  2  3  4]
 [ 5  6  7  8  9]
 [10 11 12 13 14]]

C array (A + B):
[[ 0.35305445  1.65273507  2.92257913  3.14804026  4.97935445]
 [ 5.0527562   6.78566336  7.77828242  8.10579735  9.04323689]
 [10.89933825 11.83230937 12.19057566 13.1447855  14.41127203]]

D array (linspace ile oluşturulan):
[[10.         12.85714286 15.71428571 18.57142857 21.42857143]
 [24.28571429 27.14285714 30.         32.85714286 35.71428571]
 [38.57142857 41.42857143 44.28571429 47.14285714 50.        ]]

E array (arange ile oluşturulan):
[[ 10  20  30  40  50]
 [ 60  70  80  90 100]
 [110 120 130 140 150]]

F array (D + E):
[[ 20.          32.85714286  45.71428571  58.57142857  71.42857143]
 [ 84.28571429  97.14285714 110.         122.85714286 135.71428571]
 [148.57142857 161.42857143 174.28571429 187.14285714 200.        ]]

G array (C ve F'nin elemanlarının çarpımı, 15x1):
[7.061088940056177, 54.30415213923938, 133.60361756683056, 184.3852155103653, 355.66817479180196, 425.8751656974432, 659.1787267880082, 855.6110659246024, 995.8551031562421, 1227.2964350521524, 1619.3302549091034, 1910.0727987793298, 2124.643186823985, 2459.952714212224, 2882.2544064816293]
G1 (Toplam > 1 olanlar): [200.35305444700282, 188.79559220796443, 177.2082934199887, 164.57661169338257, 153.55078301851378, 140.76704191747572, 129.64280622113705, 117.77828241749638, 105.24865449412887, 93.32895117557224, 82.32790968276731, 70.40373794439788, 57.90486137639055, 46.00192835293337, 34.41127203240815]
G2 (Toplam <= 1 olanlar): []

'\n###  EN BASINDA TERS CEVIRIP NORMAL TOPLAMA YAPILDI.\nC = C.reshape(15,1)\nF = F.reshape(15,1)\nF =F[::-1]\nG1 = []\nG2 = []\nfor i in range(len(C)):\n    toplam = C[i] + F[i]\n    if toplam > 1:\n        G1.append(toplam)\n    else:\n        G2.append(toplam)\nprint(G1,G2)\n'

In [145]:
import numpy as np

In [146]:
dizi1 = np.array([[1,2], [3,4]])
dizi1

array([[1, 2],
       [3, 4]])

In [147]:
dizi2 = np.array([[-1,-2], [-3,-4]])
dizi2

array([[-1, -2],
       [-3, -4]])

In [148]:
dizi_dikey = np.vstack((dizi1, dizi2))
dizi_dikey

array([[ 1,  2],
       [ 3,  4],
       [-1, -2],
       [-3, -4]])

In [149]:
dizi_yatay = np.hstack((dizi1, dizi2))
dizi_yatay

array([[ 1,  2, -1, -2],
       [ 3,  4, -3, -4]])

In [150]:
# problem tanimi: 2 boyutlu (2 satir ve 2 sutun) 3 adet array olustur,
# bunlari yatayda ve dikeyde birlestir
np.hstack((dizi1, dizi1, dizi1))

array([[1, 2, 1, 2, 1, 2],
       [3, 4, 3, 4, 3, 4]])

In [151]:
np.vstack((dizi1, dizi1, dizi1))

array([[1, 2],
       [3, 4],
       [1, 2],
       [3, 4],
       [1, 2],
       [3, 4]])

## **Pandas**
*   .csv, .txt bunlarin import edilmesi icin
*   Preprocessing: verinin training icin hazir hale getirilmesi
*   EDA (Kesifsel Veri Analizi): outlier tespiti, feature extraction, correlation ...

In [34]:
import pandas as pd

In [35]:
# dataframe
dictionary = {"isim": ["ali", "veli", "kenan", "murat", "ayse", "hilal"],
              "yas": [15, 16, 17, 33, np.nan , 66],
              "maas": [100.0, 150.0, 240.0, 350.0, 110.0, 220.0]}
dictionary

{'isim': ['ali', 'veli', 'kenan', 'murat', 'ayse', 'hilal'],
 'yas': [15, 16, 17, 33, nan, 66],
 'maas': [100.0, 150.0, 240.0, 350.0, 110.0, 220.0]}

In [36]:
veri = pd.DataFrame(dictionary)

In [37]:
# verinin ilk 5 satiri
veri.head()

    isim   yas   maas
0    ali  15.0  100.0
1   veli  16.0  150.0
2  kenan  17.0  240.0
3  murat  33.0  350.0
4   ayse   NaN  110.0

In [38]:
# son 5 satir
veri.tail()

    isim   yas   maas
1   veli  16.0  150.0
2  kenan  17.0  240.0
3  murat  33.0  350.0
4   ayse   NaN  110.0
5  hilal  66.0  220.0

In [39]:
# dataframe ile ilgili temel bilgilere erismemiz lazim
veri.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   isim    6 non-null      object
 1   yas     5 non-null      float64
 2   maas    6 non-null      float64
dtypes: float64(2), object(1)
memory usage: 276.0+ bytes

In [40]:
veri.describe() # veri seti icerisinde bulunan numeric feature'larin temel istatistiksel analizi

             yas        maas
count   5.000000    6.000000
mean   29.400000  195.000000
std    21.755459   94.815611
min    15.000000  100.000000
25%    16.000000  120.000000
50%    17.000000  185.000000
75%    33.000000  235.000000
max    66.000000  350.000000

In [41]:
"""
basit bir df tanimla
head, tail, columns, info ve describe fonksiyonlarini uygula
"""

'\nbasit bir df tanimla\nhead, tail, columns, info ve describe fonksiyonlarini uygula\n'

In [42]:
dictionary = {"isim": ["ali", "veli", "kenan", "murat", "ayse", "hilal"],
              "yas": [15, 16, 17, 33, 45 , 66],
              "maas": [100.0, 150.0, 240.0, 350.0, 110.0, 220.0]}
veri=pd.DataFrame(dictionary)
veri

    isim  yas   maas
0    ali   15  100.0
1   veli   16  150.0
2  kenan   17  240.0
3  murat   33  350.0
4   ayse   45  110.0
5  hilal   66  220.0

In [43]:
veri["yas"]

0    15
1    16
2    17
3    33
4    45
5    66
Name: yas, dtype: int64

In [44]:
veri["maas"]

0    100.0
1    150.0
2    240.0
3    350.0
4    110.0
5    220.0
Name: maas, dtype: float64

In [45]:
# dataframe icerisine yeni sutun ekleme
veri["sehir"] = ["istanbul", "ankara", "izmir", "bursa", "izmir", "istanbul"]
veri

    isim  yas   maas     sehir
0    ali   15  100.0  istanbul
1   veli   16  150.0    ankara
2  kenan   17  240.0     izmir
3  murat   33  350.0     bursa
4   ayse   45  110.0     izmir
5  hilal   66  220.0  istanbul

In [46]:
veri["maas_yuzde_20_zamli"] = veri["maas"] + 20*veri["maas"]/100
veri

    isim  yas   maas     sehir  maas_yuzde_20_zamli
0    ali   15  100.0  istanbul                120.0
1   veli   16  150.0    ankara                180.0
2  kenan   17  240.0     izmir                288.0
3  murat   33  350.0     bursa                420.0
4   ayse   45  110.0     izmir                132.0
5  hilal   66  220.0  istanbul                264.0

In [47]:
# veri["yas"]
# loc = location kisaltma
veri.loc[:, "yas"] # row=satirlar, column = sutunlar

0    15
1    16
2    17
3    33
4    45
5    66
Name: yas, dtype: int64

In [48]:
veri.loc[0:2, "yas"]

0    15
1    16
2    17
Name: yas, dtype: int64

In [49]:
veri.columns

Index(['isim', 'yas', 'maas', 'sehir', 'maas_yuzde_20_zamli'], dtype='object')

In [50]:
veri.loc[0:2, 'yas':'sehir']

   yas   maas     sehir
0   15  100.0  istanbul
1   16  150.0    ankara
2   17  240.0     izmir

In [51]:
veri

    isim  yas   maas     sehir  maas_yuzde_20_zamli
0    ali   15  100.0  istanbul                120.0
1   veli   16  150.0    ankara                180.0
2  kenan   17  240.0     izmir                288.0
3  murat   33  350.0     bursa                420.0
4   ayse   45  110.0     izmir                132.0
5  hilal   66  220.0  istanbul                264.0

In [52]:
# veri.loc[0:2, 1]
dictionary = {"isim": ["ali", "veli", "kenan", "murat", "ayse", "hilal"],
              "yas": [15, 16, 17, 33, 45 , 66],
              "maas": [100.0, 150.0, 240.0, 350.0, 110.0, 220.0]}
veri=pd.DataFrame(dictionary)
veri

    isim  yas   maas
0    ali   15  100.0
1   veli   16  150.0
2  kenan   17  240.0
3  murat   33  350.0
4   ayse   45  110.0
5  hilal   66  220.0

In [53]:
veri.iloc[0:2, 1]

0    15
1    16
Name: yas, dtype: int64

In [54]:
veri.iloc[[2,4], [1,2]]

   yas   maas
2   17  240.0
4   45  110.0

In [55]:
veri

    isim  yas   maas
0    ali   15  100.0
1   veli   16  150.0
2  kenan   17  240.0
3  murat   33  350.0
4   ayse   45  110.0
5  hilal   66  220.0

In [56]:
veri["maas2"] = veri["maas"] + 10
veri

    isim  yas   maas  maas2
0    ali   15  100.0  110.0
1   veli   16  150.0  160.0
2  kenan   17  240.0  250.0
3  murat   33  350.0  360.0
4   ayse   45  110.0  120.0
5  hilal   66  220.0  230.0

In [57]:
cols = veri.columns.tolist()
cols

['isim', 'yas', 'maas', 'maas2']

In [58]:
maas2_index = cols.index('maas2')
maas2_index

3

In [59]:
cols.remove('maas2')
cols

['isim', 'yas', 'maas']

In [60]:
cols.insert(1, 'maas2')  # maas2'yi yas'tan sonra ekleyin (index 2)

In [61]:
cols

['isim', 'maas2', 'yas', 'maas']

In [62]:
veri = veri[cols]

In [63]:
veri

    isim  maas2  yas   maas
0    ali  110.0   15  100.0
1   veli  160.0   16  150.0
2  kenan  250.0   17  240.0
3  murat  360.0   33  350.0
4   ayse  120.0   45  110.0
5  hilal  230.0   66  220.0

In [64]:
dictionary = {"isim": ["ali", "veli", "kenan", "murat", "ayse", "hilal"],
              "yas": [15, 16, 17, 33, 45 , 66],
              "maas": [100.0, 150.0, 240.0, 350.0, 110.0, 220.0]}
veri=pd.DataFrame(dictionary)
veri

    isim  yas   maas
0    ali   15  100.0
1   veli   16  150.0
2  kenan   17  240.0
3  murat   33  350.0
4   ayse   45  110.0
5  hilal   66  220.0

In [65]:
dictionary = {"isim": ["ali", "veli", "kenan", "murat", "ayse", "hilal"],
              "yas": [15, 16, 17, 33, 45 , 66],
              "maas": [100.0, 150.0, 240.0, 350.0, 110.0, 220.0]}
veri=pd.DataFrame(dictionary)
veri
"""
1) murat	33
2) 45 110
   66 220
3) veli 45
"""

'\n1) murat\t33\n2) 45 110\n   66 220\n3) veli 45\n'

In [66]:

# Iloc ile
print(veri.iloc[3, 0:2]) # 1.sorunun cevabı.
print(veri.iloc[4:, 1:3]) # 2.sorunun cevabı.
print(veri.iloc[1, 0], veri.iloc[4, 1]) # 3.Sorunun cevabı

print(veri.loc[3, "isim":"yas"]) # 1.sorunun cevabı.
print(veri.loc[4:, "yas":"maas"]) # 2.sorunun cevabı.
print(veri.loc[1, "isim"], veri.loc[4, "yas"]) # 3.Sorunun cevabı

isim    murat
yas        33
Name: 3, dtype: object
   yas   maas
4   45  110.0
5   66  220.0
veli 45
isim    murat
yas        33
Name: 3, dtype: object
   yas   maas
4   45  110.0
5   66  220.0
veli 45

In [67]:
print(veri.loc[3,"isim":"yas"])
print(veri.loc[4:5,"yas":"maas"])
print(veri.loc[1,"isim"],veri.loc[4,"yas"])

isim    murat
yas        33
Name: 3, dtype: object
   yas   maas
4   45  110.0
5   66  220.0
veli 45

In [68]:
dictionary = {"isim": ["ali", "veli", "kenan", "murat", "ayse", "hilal"],
              "yas": [15, 16, 17, 33, 45 , 66],
              "sehir": ["izmir", "ankara", "konya", "ankara", "ankara","antalya"]}
veri=pd.DataFrame(dictionary)
veri

    isim  yas    sehir
0    ali   15    izmir
1   veli   16   ankara
2  kenan   17    konya
3  murat   33   ankara
4   ayse   45   ankara
5  hilal   66  antalya

In [69]:
filtre1 = veri["yas"] > 22
filtre1

0    False
1    False
2    False
3     True
4     True
5     True
Name: yas, dtype: bool

In [70]:
filtrelenmis_veri = veri[filtre1]
filtrelenmis_veri

    isim  yas    sehir
3  murat   33   ankara
4   ayse   45   ankara
5  hilal   66  antalya

In [152]:
filtre2 = veri["sehir"] == "ankara"
veri[filtre2]

    isim  yas   sehir
1   veli   16  ankara
3  murat   33  ankara
4   ayse   45  ankara

In [153]:
veri[filtre1 & filtre2]

    isim  yas   sehir
3  murat   33  ankara
4   ayse   45  ankara

In [154]:
veri

    isim  yas    sehir
0    ali   15    izmir
1   veli   16   ankara
2  kenan   17    konya
3  murat   33   ankara
4   ayse   45   ankara
5  hilal   66  antalya

In [155]:
filtre3 = veri["isim"] == "ali"
veri[filtre3]

  isim  yas  sehir
0  ali   15  izmir

In [156]:
np.bitwise_and(veri["sehir"] == "ankara", veri["yas"] > 22)

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [160]:
dictionary = {"isim": ["ali", "veli", "kenan", "murat", "ayse", "hilal"],
              "yas": [15, 16, 17, 33, 45 , 66],
              "sehir": ["izmir", "ankara", "konya", "ankara", "ankara","antalya"]}
veri=pd.DataFrame(dictionary)
veri

    isim  yas    sehir
0    ali   15    izmir
1   veli   16   ankara
2  kenan   17    konya
3  murat   33   ankara
4   ayse   45   ankara
5  hilal   66  antalya

In [ ]:
"""
1) yeni sutun: maas sutunu ekle
2) yeni sutun: yas/maas orani sutunu ekle
3) yas/maas sutunu icin ortalamayi print ettir
4) ankarada yasayanlarin ortalama yasini bul
5) ankarada yasayanlarin icinden en yuksek maas alani bul
"""

In [167]:
veri["maas"] = [100,200,300,400,500,600]
veri

    isim  yas    sehir     ulke  maas
0    ali   15    izmir  turkiye   100
1   veli   16   ankara  turkiye   200
2  kenan   17    konya  turkiye   300
3  murat   33   ankara  turkiye   400
4   ayse   45   ankara  turkiye   500
5  hilal   66  antalya  turkiye   600

In [173]:
veri["yas_maas"] = veri["yas"] / veri["maas"]
veri

    isim  yas    sehir     ulke  maas  yas_maas
0    ali   15    izmir  turkiye   100  0.150000
1   veli   16   ankara  turkiye   200  0.080000
2  kenan   17    konya  turkiye   300  0.056667
3  murat   33   ankara  turkiye   400  0.082500
4   ayse   45   ankara  turkiye   500  0.090000
5  hilal   66  antalya  turkiye   600  0.110000

In [174]:
np.mean(veri["yas_maas"])

0.0948611111111111

In [175]:
veri["ulke"] = ["turkiye"]*len(veri)
veri

    isim  yas    sehir     ulke  maas  yas_maas
0    ali   15    izmir  turkiye   100  0.150000
1   veli   16   ankara  turkiye   200  0.080000
2  kenan   17    konya  turkiye   300  0.056667
3  murat   33   ankara  turkiye   400  0.082500
4   ayse   45   ankara  turkiye   500  0.090000
5  hilal   66  antalya  turkiye   600  0.110000

In [176]:
# 4) ankarada yasayanlarin ortalama yasini bul
ankarada_yasayanlar = veri[veri["sehir"] == "ankara"]
ankarada_yasayanlar

    isim  yas   sehir     ulke  maas  yas_maas
1   veli   16  ankara  turkiye   200    0.0800
3  murat   33  ankara  turkiye   400    0.0825
4   ayse   45  ankara  turkiye   500    0.0900

In [177]:
# 4) ankarada yasayanlarin ortalama yasini bul
ankarada_yasayanlar_yas = ankarada_yasayanlar["yas"]
ankarada_yasayanlar_yas

1    16
3    33
4    45
Name: yas, dtype: int64

In [182]:
# 4) ankarada yasayanlarin ortalama yasini bul
ort = np.mean(ankarada_yasayanlar_yas)
ort

31.333333333333332

In [179]:
veri[veri["sehir"] == "ankara"]["maas"].max()

500

In [183]:
# 5) ankarada yasayanlarin icinden en yuksek maas alani bul
ankarada_yasayanlar = veri[veri["sehir"] == "ankara"]
ankarada_yasayanlar

    isim  yas   sehir     ulke  maas  yas_maas
1   veli   16  ankara  turkiye   200    0.0800
3  murat   33  ankara  turkiye   400    0.0825
4   ayse   45  ankara  turkiye   500    0.0900

In [184]:
# 5) ankarada yasayanlarin icinden en yuksek maas alani bul
ankarada_yasayanlar_maas = ankarada_yasayanlar["maas"]
ankarada_yasayanlar_maas

1    200
3    400
4    500
Name: maas, dtype: int64

In [185]:
# 5) ankarada yasayanlarin icinden en yuksek maas alani bul

np.max(ankarada_yasayanlar_maas)

500

In [192]:
# maximum maasi alanin adini bulalim
ankarada_yasayanlar

    isim  yas   sehir     ulke  maas  yas_maas
1   veli   16  ankara  turkiye   200    0.0800
3  murat   33  ankara  turkiye   400    0.0825
4   ayse   45  ankara  turkiye   500    0.0900

In [193]:
ankarada_yasayanlar.reset_index(drop=True, inplace=True)
ankarada_yasayanlar

    isim  yas   sehir     ulke  maas  yas_maas
0   veli   16  ankara  turkiye   200    0.0800
1  murat   33  ankara  turkiye   400    0.0825
2   ayse   45  ankara  turkiye   500    0.0900

In [188]:
veri[veri["sehir"]=="Ankara"]["yas"].mean()

31.333333333333332

In [194]:
# maximum maasi alanin adini bulalim
ankarada_yasayanlar

    isim  yas   sehir     ulke  maas  yas_maas
0   veli   16  ankara  turkiye   200    0.0800
1  murat   33  ankara  turkiye   400    0.0825
2   ayse   45  ankara  turkiye   500    0.0900

In [ ]:
"""
for dongusu kullanarak maximum maas alanin ismini bulalim
"""

In [195]:
"""
for dongusu kullanarak maximum maas alanin ismini bulalim
"""
maks_maas = 0
maks_isim = ""
for i in range(len(ankarada_yasayanlar)):
    if ankarada_yasayanlar["maas"][i] > maks_maas:
        maks_maas = ankarada_yasayanlar["maas"][i]
        maks_isim = ankarada_yasayanlar["isim"][i]

print(maks_isim)

ayse

In [196]:
ankarada_yasayanlar.loc[ankarada_yasayanlar["maas"].idxmax(), "isim"]

'ayse'